; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-6-12)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p0-2 - location
	p0-4 - location
	p0-6 - location
	p0-8 - location
	p1-4 - location
	p1-11 - location
	p2-4 - location
	p2-5 - location
	p2-6 - location
	p3-1 - location
	p3-10 - location
	p4-3 - location
	p4-5 - location
	p5-1 - location
	p6-9 - location
	p6-11 - location
	p7-0 - location
	p7-1 - location
	p7-11 - location
	p8-1 - location
	p8-9 - location
	p9-11 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s4)
	(at driver3 s9)
	(at driver4 s4)
	(at driver5 s3)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s5)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s2)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s5)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s0)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s6)
	(at package2 s2)
	(at package3 s9)
	(at package4 s11)
	(at package5 s0)
	(at package6 s3)
	(at package7 s7)
	(at package8 s4)
	(at package9 s7)
	(at package10 s7)
	(at package11 s6)
	(at package12 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-11)
	(path p1-11 s1)
	(path s11 p1-11)
	(path p1-11 s11)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(path s6 p6-11)
	(path p6-11 s6)
	(path s11 p6-11)
	(path p6-11 s11)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-11)
	(path p7-11 s7)
	(path s11 p7-11)
	(path p7-11 s11)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(path s9 p9-11)
	(path p9-11 s9)
	(path s11 p9-11)
	(path p9-11 s11)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 99)
	(= (time-to-drive s4 s0) 99)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 40)
	(= (time-to-drive s5 s0) 40)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 4)
	(= (time-to-drive s2 s1) 4)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 62)
	(= (time-to-drive s7 s1) 62)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 92)
	(= (time-to-drive s8 s1) 92)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 54)
	(= (time-to-drive s9 s1) 54)
	(link s1 s11)
	(link s11 s1)
	(= (time-to-drive s1 s11) 89)
	(= (time-to-drive s11 s1) 89)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 27)
	(= (time-to-drive s5 s2) 27)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 25)
	(= (time-to-drive s6 s2) 25)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 75)
	(= (time-to-drive s8 s2) 75)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 46)
	(= (time-to-drive s0 s3) 46)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 21)
	(= (time-to-drive s1 s3) 21)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 17)
	(= (time-to-drive s7 s3) 17)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 2)
	(= (time-to-drive s8 s4) 2)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 82)
	(= (time-to-drive s1 s5) 82)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 73)
	(= (time-to-drive s4 s5) 73)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 13)
	(= (time-to-drive s7 s5) 13)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 26)
	(= (time-to-drive s5 s6) 26)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 88)
	(= (time-to-drive s10 s6) 88)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 56)
	(= (time-to-drive s11 s6) 56)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 3)
	(= (time-to-drive s6 s7) 3)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 41)
	(= (time-to-drive s11 s7) 41)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 26)
	(= (time-to-drive s3 s8) 26)
	(link s8 s11)
	(link s11 s8)
	(= (time-to-drive s8 s11) 91)
	(= (time-to-drive s11 s8) 91)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 45)
	(= (time-to-drive s4 s9) 45)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 30)
	(= (time-to-drive s8 s9) 30)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 14)
	(= (time-to-drive s7 s10) 14)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 91)
	(= (time-to-drive s4 s11) 91)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 100)
	(= (time-to-drive s9 s11) 100)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 38)
	(= (time-to-drive s10 s11) 38)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s7)
	(at driver3 s10)
	(at truck2 s1)
	(at truck3 s7)
	(at truck4 s8)
	(at truck5 s10)
	(at truck6 s0)
	(at package1 s4)
	(at package2 s2)
	(at package3 s6)
	(at package4 s9)
	(at package5 s2)
	(at package7 s1)
	(at package8 s4)
	(at package9 s9)
	(at package10 s10)
	(at package11 s4)
	(at package12 s6)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 3 of 19
2. (walk driver1 s2 p2-5)
   deleted: (at driver1 s2)
   added: (at driver1 p2-5)
   goals met: 3 of 19
3. (drive-truck truck2 s4 s11 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s11)
   changed: (fuel-used) from 0 to 910
   goals met: 3 of 19
4. (walk driver1 p2-5 s5)
   deleted: (at driver1 p2-5)
   added: (at driver1 s5)
   goals met: 3 of 19
5. (board-truck driver1 truck5 s5)
   deleted: (at driver1 s5) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 3 of 19
6. (drive-truck truck2 s11 s7 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s7)
   changed: (fuel-used) from 910 to 1320
   goals met: 3 of 19
7. (load-truck package10 truck2 s7)
   deleted: (at package10 s7)
   added: (in package10 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 3 of 19
8. (disembark-truck driver2 truck2 s7)
   deleted: (driving driver2 truck2)
   added: (at driver2 s7) (empty truck2)
   goals met: 4 of 19
9. (drive-truck truck5 s5 s6 driver1)
   deleted: (at truck5 s5)
   added: (at truck5 s6)
   changed: (fuel-used) from 1320 to 1580
   goals met: 4 of 19
10. (drive-truck truck5 s6 s11 driver1)
   deleted: (at truck5 s6)
   added: (at truck5 s11)
   changed: (fuel-used) from 1580 to 2140
   goals met: 4 of 19
11. (load-truck package7 truck2 s7)
   deleted: (at package7 s7)
   added: (in package7 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 4 of 19
12. (walk driver4 s4 p4-5)
   deleted: (at driver4 s4)
   added: (at driver4 p4-5)
   goals met: 4 of 19
13. (load-truck package4 truck5 s11)
   deleted: (at package4 s11)
   added: (in package4 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 4 of 19
14. (walk driver4 p4-5 s5)
   deleted: (at driver4 p4-5)
   added: (at driver4 s5)
   goals met: 4 of 19
15. (board-truck driver4 truck3 s5)
   deleted: (at driver4 s5) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 4 of 19
16. (drive-truck truck3 s5 s2 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (fuel-used) from 2140 to 2410
   goals met: 4 of 19
17. (disembark-truck driver4 truck3 s2)
   deleted: (driving driver4 truck3)
   added: (at driver4 s2) (empty truck3)
   goals met: 4 of 19
18. (drive-truck truck5 s11 s9 driver1)
   deleted: (at truck5 s11)
   added: (at truck5 s9)
   changed: (fuel-used) from 2410 to 3510
   goals met: 4 of 19
19. (unload-truck package4 truck5 s9)
   deleted: (in package4 truck5)
   added: (at package4 s9)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 5 of 19
20. (load-truck package3 truck5 s9)
   deleted: (at package3 s9)
   added: (in package3 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 5 of 19
21. (drive-truck truck5 s9 s11 driver1)
   deleted: (at truck5 s9)
   added: (at truck5 s11)
   changed: (fuel-used) from 3510 to 4610
   goals met: 5 of 19
22. (board-truck driver4 truck3 s2)
   deleted: (at driver4 s2) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 5 of 19
23. (drive-truck truck3 s2 s5 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   changed: (fuel-used) from 4610 to 4880
   goals met: 5 of 19
24. (drive-truck truck3 s5 s7 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   changed: (fuel-used) from 4880 to 5010
   goals met: 6 of 19
25. (drive-truck truck5 s11 s4 driver1)
   deleted: (at truck5 s11)
   added: (at truck5 s4)
   changed: (fuel-used) from 5010 to 6011
   goals met: 6 of 19
26. (load-truck package9 truck3 s7)
   deleted: (at package9 s7)
   added: (in package9 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 19
27. (drive-truck truck3 s7 s5 driver4)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (fuel-used) from 6011 to 6154
   goals met: 5 of 19
28. (drive-truck truck5 s4 s9 driver1)
   deleted: (at truck5 s4)
   added: (at truck5 s9)
   changed: (fuel-used) from 6154 to 6649
   goals met: 5 of 19
29. (drive-truck truck3 s5 s6 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (fuel-used) from 6649 to 6935
   goals met: 5 of 19
30. (load-truck package1 truck3 s6)
   deleted: (at package1 s6)
   added: (in package1 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 5 of 19
31. (load-truck package11 truck3 s6)
   deleted: (at package11 s6)
   added: (in package11 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 5 of 19
32. (drive-truck truck3 s6 s5 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 6935 to 7351
   goals met: 5 of 19
33. (board-truck driver2 truck2 s7)
   deleted: (at driver2 s7) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 19
34. (drive-truck truck2 s7 s10 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s10)
   changed: (fuel-used) from 7351 to 7533
   goals met: 4 of 19
35. (unload-truck package10 truck2 s10)
   deleted: (in package10 truck2)
   added: (at package10 s10)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 5 of 19
36. (drive-truck truck5 s9 s11 driver1)
   deleted: (at truck5 s9)
   added: (at truck5 s11)
   changed: (fuel-used) from 7533 to 8633
   goals met: 5 of 19
37. (drive-truck truck2 s10 s7 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s7)
   changed: (fuel-used) from 8633 to 8787
   goals met: 5 of 19
38. (disembark-truck driver2 truck2 s7)
   deleted: (driving driver2 truck2)
   added: (at driver2 s7) (empty truck2)
   goals met: 6 of 19
39. (drive-truck truck3 s5 s4 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 8787 to 9955
   goals met: 6 of 19
40. (unload-truck package1 truck3 s4)
   deleted: (in package1 truck3)
   added: (at package1 s4)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 7 of 19
41. (unload-truck package11 truck3 s4)
   deleted: (in package11 truck3)
   added: (at package11 s4)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 8 of 19
42. (drive-truck truck5 s11 s10 driver1)
   deleted: (at truck5 s11)
   added: (at truck5 s10)
   changed: (fuel-used) from 9955 to 10373
   goals met: 9 of 19
43. (drive-truck truck3 s4 s9 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s9)
   changed: (fuel-used) from 10373 to 10868
   goals met: 9 of 19
44. (unload-truck package9 truck3 s9)
   deleted: (in package9 truck3)
   added: (at package9 s9)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 10 of 19
45. (board-truck driver2 truck2 s7)
   deleted: (at driver2 s7) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 9 of 19
46. (drive-truck truck2 s7 s5 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   changed: (fuel-used) from 10868 to 11011
   goals met: 9 of 19
47. (drive-truck truck5 s10 s6 driver1)
   deleted: (at truck5 s10)
   added: (at truck5 s6)
   changed: (fuel-used) from 11011 to 11979
   goals met: 8 of 19
48. (disembark-truck driver4 truck3 s9)
   deleted: (driving driver4 truck3)
   added: (at driver4 s9) (empty truck3)
   goals met: 8 of 19
49. (board-truck driver3 truck3 s9)
   deleted: (at driver3 s9) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 8 of 19
50. (drive-truck truck3 s9 s11 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s11)
   changed: (fuel-used) from 11979 to 12979
   goals met: 8 of 19
51. (unload-truck package3 truck5 s6)
   deleted: (in package3 truck5)
   added: (at package3 s6)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 9 of 19
52. (drive-truck truck3 s11 s10 driver3)
   deleted: (at truck3 s11)
   added: (at truck3 s10)
   changed: (fuel-used) from 12979 to 13359
   goals met: 9 of 19
53. (disembark-truck driver3 truck3 s10)
   deleted: (driving driver3 truck3)
   added: (at driver3 s10) (empty truck3)
   goals met: 10 of 19
54. (drive-truck truck5 s6 s5 driver1)
   deleted: (at truck5 s6)
   added: (at truck5 s5)
   changed: (fuel-used) from 13359 to 13619
   goals met: 10 of 19
55. (drive-truck truck2 s5 s7 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   changed: (fuel-used) from 13619 to 13762
   goals met: 10 of 19
56. (board-truck driver3 truck3 s10)
   deleted: (at driver3 s10) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 9 of 19
57. (drive-truck truck2 s7 s1 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s1)
   changed: (fuel-used) from 13762 to 14444
   goals met: 10 of 19
58. (unload-truck package7 truck2 s1)
   deleted: (in package7 truck2)
   added: (at package7 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 11 of 19
59. (drive-truck truck2 s1 s7 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (fuel-used) from 14444 to 15064
   goals met: 10 of 19
60. (disembark-truck driver2 truck2 s7)
   deleted: (driving driver2 truck2)
   added: (at driver2 s7) (empty truck2)
   goals met: 11 of 19
61. (drive-truck truck5 s5 s1 driver1)
   deleted: (at truck5 s5)
   added: (at truck5 s1)
   changed: (fuel-used) from 15064 to 15884
   goals met: 11 of 19
62. (load-truck package12 truck5 s1)
   deleted: (at package12 s1)
   added: (in package12 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 11 of 19
63. (drive-truck truck5 s1 s5 driver1)
   deleted: (at truck5 s1)
   added: (at truck5 s5)
   changed: (fuel-used) from 15884 to 16786
   goals met: 11 of 19
64. (drive-truck truck5 s5 s0 driver1)
   deleted: (at truck5 s5)
   added: (at truck5 s0)
   changed: (fuel-used) from 16786 to 17226
   goals met: 11 of 19
65. (load-truck package5 truck5 s0)
   deleted: (at package5 s0)
   added: (in package5 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 11 of 19
66. (drive-truck truck5 s0 s5 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s5)
   changed: (fuel-used) from 17226 to 17746
   goals met: 11 of 19
67. (board-truck driver2 truck2 s7)
   deleted: (at driver2 s7) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 10 of 19
68. (drive-truck truck5 s5 s2 driver1)
   deleted: (at truck5 s5)
   added: (at truck5 s2)
   changed: (fuel-used) from 17746 to 18097
   goals met: 10 of 19
69. (unload-truck package5 truck5 s2)
   deleted: (in package5 truck5)
   added: (at package5 s2)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 11 of 19
70. (disembark-truck driver2 truck2 s7)
   deleted: (driving driver2 truck2)
   added: (at driver2 s7) (empty truck2)
   goals met: 12 of 19
71. (drive-truck truck5 s2 s6 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s6)
   changed: (fuel-used) from 18097 to 18372
   goals met: 12 of 19
72. (unload-truck package12 truck5 s6)
   deleted: (in package12 truck5)
   added: (at package12 s6)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 13 of 19
73. (disembark-truck driver1 truck5 s6)
   deleted: (driving driver1 truck5)
   added: (at driver1 s6) (empty truck5)
   goals met: 13 of 19
74. (walk driver1 s6 p2-6)
   deleted: (at driver1 s6)
   added: (at driver1 p2-6)
   goals met: 13 of 19
75. (walk driver1 p2-6 s2)
   deleted: (at driver1 p2-6)
   added: (at driver1 s2)
   goals met: 13 of 19
76. (walk driver4 s9 p6-9)
   deleted: (at driver4 s9)
   added: (at driver4 p6-9)
   goals met: 13 of 19
77. (walk driver4 p6-9 s6)
   deleted: (at driver4 p6-9)
   added: (at driver4 s6)
   goals met: 13 of 19
78. (board-truck driver4 truck5 s6)
   deleted: (at driver4 s6) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 13 of 19
79. (drive-truck truck5 s6 s10 driver4)
   deleted: (at truck5 s6)
   added: (at truck5 s10)
   changed: (fuel-used) from 18372 to 19252
   goals met: 14 of 19
80. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   goals met: 14 of 19
81. (board-truck driver2 truck2 s7)
   deleted: (at driver2 s7) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 13 of 19
82. (drive-truck truck2 s7 s1 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s1)
   changed: (fuel-used) from 19252 to 19872
   goals met: 14 of 19
83. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   goals met: 15 of 19
84. (drive-truck truck3 s10 s7 driver3)
   deleted: (at truck3 s10)
   added: (at truck3 s7)
   changed: (fuel-used) from 19872 to 20012
   goals met: 16 of 19
85. (drive-truck truck2 s1 s2 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 20012 to 20052
   goals met: 15 of 19
86. (disembark-truck driver2 truck2 s2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s2) (empty truck2)
   goals met: 15 of 19
87. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 15 of 19
88. (drive-truck truck4 s2 s8 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s8)
   changed: (fuel-used) from 20052 to 20802
   goals met: 16 of 19
89. (drive-truck truck4 s8 s3 driver2)
   deleted: (at truck4 s8)
   added: (at truck4 s3)
   changed: (fuel-used) from 20802 to 21062
   goals met: 15 of 19
90. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   goals met: 14 of 19
91. (walk driver1 p0-2 s2)
   deleted: (at driver1 p0-2)
   added: (at driver1 s2)
   goals met: 14 of 19
92. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 14 of 19
93. (drive-truck truck2 s2 s5 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (fuel-used) from 21062 to 21332
   goals met: 14 of 19
94. (drive-truck truck2 s5 s0 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (fuel-used) from 21332 to 21732
   goals met: 14 of 19
95. (drive-truck truck4 s3 s7 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s7)
   changed: (fuel-used) from 21732 to 21902
   goals met: 14 of 19
96. (disembark-truck driver2 truck4 s7)
   deleted: (driving driver2 truck4)
   added: (at driver2 s7) (empty truck4)
   goals met: 15 of 19
97. (disembark-truck driver3 truck3 s7)
   deleted: (driving driver3 truck3)
   added: (at driver3 s7) (empty truck3)
   goals met: 15 of 19
98. (board-truck driver3 truck4 s7)
   deleted: (at driver3 s7) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 15 of 19
99. (drive-truck truck4 s7 s10 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s10)
   changed: (fuel-used) from 21902 to 22042
   goals met: 15 of 19
100. (disembark-truck driver3 truck4 s10)
   deleted: (driving driver3 truck4)
   added: (at driver3 s10) (empty truck4)
   goals met: 16 of 19
101. (disembark-truck driver4 truck5 s10)
   deleted: (driving driver4 truck5)
   added: (at driver4 s10) (empty truck5)
   goals met: 16 of 19
102. (board-truck driver4 truck4 s10)
   deleted: (at driver4 s10) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 16 of 19
103. (drive-truck truck4 s10 s11 driver4)
   deleted: (at truck4 s10)
   added: (at truck4 s11)
   changed: (fuel-used) from 22042 to 22422
   goals met: 16 of 19
104. (drive-truck truck4 s11 s8 driver4)
   deleted: (at truck4 s11)
   added: (at truck4 s8)
   changed: (fuel-used) from 22422 to 23332
   goals met: 17 of 19
105. (drive-truck truck2 s0 s5 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   changed: (fuel-used) from 23332 to 23732
   goals met: 17 of 19
106. (drive-truck truck2 s5 s1 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 23732 to 24552
   goals met: 18 of 19
107. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 18 of 19
108. (drive-truck truck4 s8 s1 driver4)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   changed: (fuel-used) from 24552 to 25472
   goals met: 17 of 19
109. (disembark-truck driver4 truck4 s1)
   deleted: (driving driver4 truck4)
   added: (at driver4 s1) (empty truck4)
   goals met: 17 of 19
110. (walk driver1 s1 p1-4)
   deleted: (at driver1 s1)
   added: (at driver1 p1-4)
   goals met: 17 of 19
111. (walk driver1 p1-4 s4)
   deleted: (at driver1 p1-4)
   added: (at driver1 s4)
   goals met: 17 of 19
112. (walk driver1 s4 p0-4)
   deleted: (at driver1 s4)
   added: (at driver1 p0-4)
   goals met: 17 of 19
113. (walk driver1 p0-4 s0)
   deleted: (at driver1 p0-4)
   added: (at driver1 s0)
   goals met: 18 of 19
114. (board-truck driver4 truck4 s1)
   deleted: (at driver4 s1) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 18 of 19
115. (drive-truck truck4 s1 s8 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s8)
   changed: (fuel-used) from 25472 to 26392
   goals met: 19 of 19
